tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew 'gh'
brew 'git'
brew 'neovim'
brew 'php'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'pnpm'
brew "readline"
brew "awscli"
brew "cmake"
brew "fzf"
brew "gcc"
brew "ranger"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "tmux"
brew "tpm"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "openssl@3", link: false
brew "postgresql@18"
brew "sqlite"
brew "poppler"
brew "eza"
brew "zoxide"
brew "lazygit"
cask 'tableplus'
cask "brave-browser"
cask "docker"
cask 'imageoptim'
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "obsidian"
cask "spotify"
cask "karabiner-elements"
cask "visual-studio-code"
cask "vlc"
cask "shortcat"
